//1
//Какие циклы есть в javaScript?
// for
// while
// do while

// 2 Создайте объект Student, добавьте ему поля на
// усмотрение удалите одно любое поле и сделайте объект неизменяемым.
// const Student={
// name:"Askat",
// age:"20",
// from:"Bishkek"
// }
// delete Student.age
// Object.freeze(Student)
// console.log(Student);

// 3
// Что такое Хоистинг и как его избежать при создании переменной
//всплывание переменной в самый вверх кода ее можно избежать такими ключевыми словами как const и let

// 4
// В чем различие между  null undefined
// null это когда такое ключевое слово есть но пока что ключевое слово в нем не подразумевается
//undefined это когда что то пошло не так Н: слово неправильно написали либо такого ключевого слово нет

// 5
// Как мы можем получить reference error
// когда мы не обьявили переменную


// 6
// В чем разница между методом и функцией приведите примеры
//


// 7
// return внутри функций зачем он  нужен? Что вернет функция если нет return
// функция обязательно должен что то возвращать, если он ничего не возврашает то он выведет undefined