// task 1 1. Выведите столбец чисел от 1 до 50.
// for (let i=1;i<51;i++){
//     console.log(i);
// }

// task 2 2. Создайте переменную с пустым массивом,
// заполните массив 10-ю элементами X с помощью цикла.

// let arr=[]
// for(let i=0;i<10;i++){
//     arr=[...arr,"x"]
// }
// console.log(arr);

// task 3 3. Вам дан массив с элементами [5, 3, 1, 2, 7].
// С помощью цикла for выведите все эти элементы в консоль.

// let arr=[5, 3, 1, 2, 7]
// for (let i=0;i<arr.length;i++){
//     console.log(arr[i]);
// }


// task 4 4. Вам дан массив с элементами [5, 2, 1, 2].
// С помощью цикла for найдите произведение элементов этого массива.
// let arr=[5, 2, 1, 2]
// let newArr=1
// for (let i=1;i<5;i++){
//     console.log(arr);
// }



// task 5. Выведите в консоль столбец четных чисел в промежутке от 0 до 100.
// for (let i=0;i<=100;i++){
//     if(i%2===0){
//         console.log(i);
//     }
// }

// task 6 С помощью цикла найдите сумму чисел от 1 до 100 и выведите в консоль.


// task 7. Вам дан массив с элементами [2, 4, 5, 6, 8]. С помощью цикла for
// найдите сумму элементов этого массива. Запишите ее в переменную result.


// task 8 8. Вам дан массив [3, 4, 6, 12, 3, 5].
// С помощью цикла for и оператора if выведите на экран столбец тех элементов массива,
// которые больше 3-х, но меньше 10.
// let arr=[3, 4, 6, 12, 3, 5]
// for (let i=0;i<arr.length;i++){
//     if(arr<3&&arr>10){
        
//     }
// }

// task 9 Вам дан массив с числами.
// Числа могут быть положительными и отрицательными.
// Найдите сумму положительных элементов массива.


// task 10 Вам дан массив с числами [5, 1, 3, 7, 6, 15, 3, 20]. С помощью цикла for и оператора if
// проверьте есть ли в массиве элемент со значением,
// равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего делать не надо.