import React from 'react'

const History = () => {
  return (
    <>
      <section className='history'>
        <div className='container'>
          <div className='history__wrapper'>
            <h1 className='history__title'>Вселенная покемонов</h1>
            <div className='history__card'>
              <img className='history__img' src='https://upload.wikimedia.org/wikipedia/ru/2/27/Pokemonseason1DVDBoxSet.jpg' alt='Pokemon' />
              <div className='history__links'>
                <h3 className='history__subTitle'>История создания</h3>
                <p className='history__text'>«Покемо́н»-популярная медиафраншиза, созданная Сатоси Тадзири в 1996 году. Товарный знак «Покемон» принадлежит <a href='https://ru.wikipedia.org/wiki/The_Pok%C3%A9mon_Company' target='blank' className='history__info'>The Pokémon Company</a>. По мотивам игр существует аниме, пользующееся колоссальным успехом в мире, а также манга, коллекционная карточная игра и прочие сопутствующие товары.В 2020 году общая стоимость франшизы «Покемон» оценивалась в 95 миллиардов долларов США и она является одной из самых кассовых медиафраншиз за всю историю.</p>
              </div>
            </div>
            <div className='history__card'>
              <div className='history__links'>
                <h3 className='history__subTitle'>Покемоны</h3>
                <p className='history__text'>Вымышленная вселенная «Покемон» выполнена в антураже альтернативной современности, но в этом мире живут особые существа — покемоны . Покемоны в меру разумны, некоторые умеют разговаривать.Они бывают разных видов (на данный момент по играм, манге и аниме их известно 898) и обладают сверхъестественными способностями: у разных видов они разные, помимо этого, они могут принадлежать к различным типам — к категориям по стихийной принадлежности. Если покемон побеждает в битве, он получает опыт, при достижении определённого количества опыта у него повышается уровень, а значит, и характеристики. При определённых условиях (при достижении определённого уровня, при использовании предмета и т. п.) покемон может эволюционировать — преобразовываться в развитую форму, которая сильнее предыдущей и считается самостоятельным видом</p>
              </div>
              <img className='history__img' src='https://cs4.pikabu.ru/post_img/2016/07/31/10/1469984694160477471.jpg' alt='Pokemon' />
            </div>
            <div className='history__card'>
              <img className='history__img' src='https://avatars.dzeninfra.ru/get-zen_doc/3323992/pub_5f896398f18baa2479e5fb77_5f896cabff07445a5c29fe2e/scale_1200' alt='Pokemon' />
              <div className='history__links'>
                <h3 className='history__subTitle'>Тренера покемонов</h3>
                <p className='history__text'>Люди, называющие себя тренерами покемонов, подготавливают покемонов для сражений с покемонами других тренеров. Непосредственно сами тренеры не принимают участия в боях: сражаются только покемоны, которым хозяева дают команды, какую атаку или способность применить. Бои проходят до момента, пока все покемоны одного из тренеров не падают без сознания или один из тренеров не сдаётся, так как до смерти схватки не происходят никогда.Хорошим тренером считается тот, кто хорошо заботится о своих покемонах, — аллюзия на заботу людей о домашних животных. Никакой практической пользы тренировка покемонов не несёт, но она развивает в тренере ответственность, собранность, сострадание, умение планировать. Новых покемонов тренеры обычно получают, ловя их на воле: тренер с помощью своих покемонов побеждает дикого покемона, а затем кидает в него покебол — карманное устройство в виде шара, предназначенное для переноски покемонов любого размера</p>
              </div>

            </div>
            <div className='history__card'>
              <div className='history__links'>
                <h3 className='history__subTitle'>Аниме</h3>
                <p className='history__text'>После успеха Pokémon Red и Green было принято решение сделать аниме-экранизацию этих двух игр, а впоследствии и следующих игр серии. Первая серия «Покемон! Я выбираю тебя!» была показана 1 апреля 1997 года.С тех пор вышло более 800 серий, выпуск продолжается до сих пор. По «Покемону» существуют также полнометражные фильмы, часть из которых была показана в кинотеатрах. Вместе с полнометражными выходят короткометражные фильмы. По состоянию на 2018 год вышло 20 полнометражных фильмов и 27 короткометражных.Сюжет повествует о мальчике по имени Эш из Паллет Тауна, который мечтает стать Мастером покемонов — лучшим из тренеров.Его первым Покемоном был Пикачу</p>
              </div>
              <img className='history__img' src='https://avatars.mds.yandex.net/get-kinopoisk-image/4483445/eb02d01e-ac1a-4a44-a6a7-5d961a27c543/600x900' alt='Pokemon' />
            </div>
            <div className='history__card'>
              <img className='history__img' src='https://upload.wikimedia.org/wikipedia/ru/thumb/6/67/Pokemon_Special.jpg/275px-Pokemon_Special.jpg' alt='Pokemon' />
              <div className='history__links'>
                <h3 className='history__subTitle'>Манга</h3>
                <p className='history__text'>По мотивам «Покемона» существуют различные серии манги, более или менее известные.Первой серией манги стала Pokémon Pocket Monsters, не выходившая за пределами Японии, до этого печатались лишь отдельные выпуски.Для Pokémon Pocket Monsters характерны весьма специфические юмор и художественный стиль. Pokémon: The Electric Tale of Pikachu 1997 года в четырёх томах стала второй мангой по «Покемону». Она сделана по мотивам первых двух сезонов аниме, при этом сюжет был несколько изменён.Манга Pokémon Adventures, также начавшая выходить в 1997 году, основана на играх основной серии.Сатоси Тадзири(создатель аниме) как-то сказал, что манга Adventures понравилась ему больше, чем аниме, так как мир «Покемона», изображённый в манге, ближе к изначальной задумке Тадзири, чем мир «Покемона», показанный в аниме</p>
              </div>

            </div>
            <a className='history__info' href='https://ru.wikipedia.org/wiki/%D0%9F%D0%BE%D0%BA%D0%B5%D0%BC%D0%BE%D0%BD#%D0%9E%D1%81%D0%BD%D0%BE%D0%B2%D0%BD%D0%B0%D1%8F_%D0%B8%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%86%D0%B8%D1%8F' target='blank'>Узнать больше вы можете здесь</a>
          </div>
        </div>

      </section>
    </>
  )
}

export default History