// переменнаябраузере это ячейка в браузере 
// console.log("hello world"); переменная
// если текст мы пишем без ковычек то это переменная
//  455-цивровые данные
//  "hello"-текстовые данные
//  boolean- try  false  тип данных
//  переменные это ячейка в браузере

// как называть переменную
// 1 - давать осмысленные название
// 2 - не использовать ключевые слова
// 3 - не называть на русском
// 4 - не делать пробелы

// let num = 455
// let num2 = 8

// let str= "hello "
// let str2= "world"

// let title= "1 room "
// let price=34
// let sum=title+price

// console.log(str+str2);
// console.log(num/num2);
// console.log(sum);


/// if else инструкция if выполняет инструкцию, условие выполняется (истинно). 
// Если условие не выполняется (ложно),то может быть выполнена другая инструкция


///если число является положительным то вывести в консоль положительное число
//если является отриц то вывести отрицательное число

// let num = 0
// if (num >0) {
//     console.log("положительное число");    
// }else if(num === 0){
//     console.log("num=0");
// }
// else{
//     console.log("отрицательное число");
// }

// = присвоение 
//== это нестрогое равенства сравнивает только значение без типа данных
//=== строгое равенства сравнивает и значение и тип данных (ее мы используем в условиях)


// %- этот оператор возвращает остаток от деление первого операнда на второй
//операнда в языках програмирование - аргумент операции: данные. которые обрабатывается командой
// console.log(5%4);

// let num=10 //если число четное(делитсся на 2) то выведи even. Если число нечетное(не делится на 2) то выведи odd
// if (num % 2 === 0){
//     console.log("even");
// }else{
//     console.log("odd");
// }


// let a = 9
// if (a === 10) {
//     console.log("верно");
// }else{
//     console.log("не верно");
// }

// let a=100
// let b=100
// if (a>b){
//     console.log("а больше b")
// }
// else{
//     console.log("a меньше b");
// }

// let s=(3===3)
// console.log(typeof s);

// let a=10
// let b=2
// if(a%b===0){
//     console.log("четное число");
// }else{
//     console.log("нечетное число");
// }

//&&- и (одновременно) *
//||- или  +
//true-1
//false-0

// console.log(true * false);

// let a=7
// //       1 true * 1 true + 0 false
// console.log(a>5 && a<10 || a>8);




















