// 1 Напишите функцию которая принимает строку “головоломка” и заменяет все буквы “o” на  “a”

// let a="головоломка"
// console.log(a.replaceAll("о","а"));

// 2 Напишите функцию которая принимает строку “           hello world.        ” и удаляет отступы по краям

// let a = "           hello world.        "
// console.log(a.trim());

// 3 Вам дана переменная str = “Ada Programming Courses “.
//     Выведите в консоль все слова этой строки, используя метод split. Пример: [ “Ada”, “ Programming”, “Courses” ]

// let str = "Ada Programming Courses "
// let b=str.trim()
// console.log(b.split(" "));

// 4 Напишите функцию, которая принимает массив и возвращает:



//     Минимальный элемент

//     Максимальный элемент

//     Длину массива